In [1]:
# all libraries and modules

import pandas
import numpy
import math

In [2]:
# Load the dataset
df = pandas.read_csv(r"C:\Users\DELL\Downloads\tdi dataset.csv") #Load the dataframe

In [3]:
df["Family Size"] = df["sibsp"] + df["parch"] + 1 # Create a family size column to add siblings/spouse amd parent/children
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",4
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,2
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,2
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,1
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,1
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,1

In [4]:
bins = [0, 19,45,float('inf')]
labels = ["Teenager", "Youth", "old"]
df["Age Group"] = pandas.cut(df["age"], bins = bins, labels = labels, right = False)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4,Youth

In [5]:
#Check for duplicates (Returns 0 if no duplicate was found)
df.duplicated().sum()

0

In [6]:
#Check for number of rows and columns
df.shape

(1309, 16)

In [7]:
#Check dataset info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pclass       1309 non-null   int64
 1   survived     1309 non-null   int64
 2   name         1309 non-null   object
 3   sex          1309 non-null   object
 4   age          1046 non-null   float64
 5   sibsp        1309 non-null   int64
 6   parch        1309 non-null   int64
 7   ticket       1309 non-null   object
 8   fare         1308 non-null   float64
 9   cabin        295 non-null    object
 10  embarked     1307 non-null   object
 11  boat         486 non-null    object
 12  body         121 non-null    float64
 13  home.dest    745 non-null    object
 14  Family Size  1309 non-null   int64
 15  Age Group    1046 non-null   category
dtypes: category(1), float64(3), int64(5), object(7)
memory usage: 154.9+ KB

 # <font color='#ffcocb' size=5>Those not up to 1309 non-null values have null values. Now we replace the null values<font>

In [8]:
#Let's fill all null values with the mean of our ages
ageMean = math.floor(df["age"].mean())
df.loc[:, "age"] = df.age.fillna(value=ageMean)

In [9]:
# The fare has only one missing value, we print it out to see how the row looks like
df[df["fare"].isna()]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size,Age Group
1225,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S,NaN,261.0,NaN,1,old

In [10]:
#We can just drop the record and we will be left with 1308 records
df = df.dropna(subset=["fare"])
df.shape

(1308, 16)

In [11]:
# cabin Has over 1000 null calues, we can replace the null values with not specified
df.loc[:, "cabin"] = df.cabin.fillna(value="Not specified")

C:\Users\DELL\anaconda3\lib\site-packages\pandas\core\indexing.py:1676: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(ilocs[0], value, pi)

In [12]:
'''Since we can't guess correctly passengers port of embarkation and the number of records with unknown port of embarkation is 
    low, we can drop the embarked columns with nul values'''
df = df.dropna(subset=["embarked"])

In [13]:
df.shape

(1306, 16)

In [14]:
df

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",4,Youth
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,Not specified,C,NaN,328.0,NaN,2,Teenager
1305,3,0,"Zabour, Miss. Thamine",female,29.0000,1,0,2665,14.4542,Not specified,C,NaN,NaN,NaN,2,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,Not specified,C,NaN,304.0,NaN,1,Youth
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,Not specified,C,NaN,NaN,NaN,1,Youth
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,Not specified,S,NaN,NaN,NaN,1,Youth

In [15]:
# We also change null values in boat to not specified
df['boat'] = df["boat"].fillna("Not Specified")

In [16]:
df[:20]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,NaN,"Montreal, PQ / Chesterville, ON",4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,135.0,"Montreal, PQ / Chesterville, ON",4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,NaN,"Montreal, PQ / Chesterville, ON",4,Youth
5,1,1,"Anderson, Mr. Harry",male,48.0000,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY",1,old
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0000,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",2,old
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0000,0,0,112050,0.0000,A36,S,Not Specified,NaN,"Belfast, NI",1,Youth
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0000,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",3,old
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0000,0,0,PC 17609,49.5042,Not specified,C,Not Specified,22.0,"Montevideo, Uruguay",1,old
10,1,0,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,Not Specified,124.0,"New York, NY",2,old
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18.0000,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,"New York, NY",2,Teenager
12,1,1,"Aubart, Mme. Leontine Pauline",female,24.0000,0,0,PC 17477,69.3000,B35,C,9,NaN,"Paris, France",1,Youth
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26.0000,0,0,19877,78.8500,Not specified,S,6,NaN,NaN,1,Youth
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0000,0,0,27042,30.0000,A23,S,B,NaN,"Hessle, Yorks",1,old
15,1,0,"Baumann, Mr. John D",male,29.0000,0,0,PC 17318,25.9250,Not specified,S,Not Specified,NaN,"New York, NY",1,NaN
16,1,0,"Baxter, Mr. Quigg Edmond",male,24.0000,0,1,PC 17558,247.5208,B58 B60,C,Not Specified,NaN,"Montreal, PQ",2,Youth
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0000,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ",2,old
18,1,1,"Bazzani, Miss. Albina",female,32.0000,0,0,11813,76.2917,D15,C,8,NaN,NaN,1,Youth
19,1,0,"Beattie, Mr. Thomson",male,36.0000,0,0,13050,75.2417,C6,C,A,NaN,"Winnipeg, MN",1,Youth

In [17]:
# For body, we assume the body of the passengers with null values are yet to be recovered 
#so we rename all null values to "not recovered"
df.loc[:, "body"] = df.body.fillna("not recovered")

In [18]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,not recovered,"St Louis, MO",1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,not recovered,"Montreal, PQ / Chesterville, ON",4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,not recovered,"Montreal, PQ / Chesterville, ON",4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,135.0,"Montreal, PQ / Chesterville, ON",4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,not recovered,"Montreal, PQ / Chesterville, ON",4,Youth

In [19]:
#Let's drop the entire home.dest column as it will not be needed in our analysis
try:
    df = df.drop("home.dest", axis=1)
    print(df.shape)
except (KeyError):
    print("No such table or table deleted already")

(1306, 15)

In [20]:
# Let's confirm if we have no more duplicates
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1306 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pclass       1306 non-null   int64
 1   survived     1306 non-null   int64
 2   name         1306 non-null   object
 3   sex          1306 non-null   object
 4   age          1306 non-null   float64
 5   sibsp        1306 non-null   int64
 6   parch        1306 non-null   int64
 7   ticket       1306 non-null   object
 8   fare         1306 non-null   float64
 9   cabin        1306 non-null   object
 10  embarked     1306 non-null   object
 11  boat         1306 non-null   object
 12  body         1306 non-null   object
 13  Family Size  1306 non-null   int64
 14  Age Group    1043 non-null   category
dtypes: category(1), float64(2), int64(5), object(7)
memory usage: 154.5+ KB

In [21]:
# We have to update our age group
bins = [0, 19,45,float('inf')]
labels = ["Teenager", "Youth", "old"]
df["Age Group"] = pandas.cut(df["age"], bins = bins, labels = labels, right = False)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,not recovered,1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,not recovered,4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,not recovered,4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,135.0,4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,Not Specified,not recovered,4,Youth

In [22]:
#Let's confirm wether all is fixed
df.dtypes

pclass            int64
survived          int64
name             object
sex              object
age             float64
sibsp             int64
parch             int64
ticket           object
fare            float64
cabin            object
embarked         object
boat             object
body             object
Family Size       int64
Age Group      category
dtype: object

 # <font color='#ffcocb' size=5>Now, there are no more null values. Let's work on using the correct data types.<font>

In [23]:
#Let's make the name column a string
df["name"] = df["name"].astype("string")
df["name"].dtype

StringDtype

In [24]:
#Let's make the sex column a string
df["sex"] = df["sex"].convert_dtypes()
df["sex"].dtype

StringDtype

In [25]:
#the age column should be an integer
df["age"] = df["age"].astype(int)
df["age"].dtype

dtype('int32')

In [26]:
#Let's make the ticket an string too (Ther's no id and the ticket cna serve as our primarykey)
df["ticket"] = df["ticket"].convert_dtypes(str)
df["ticket"].dtype

StringDtype

In [27]:
df["cabin"] = df["cabin"].convert_dtypes(str)
df["cabin"].dtype

StringDtype

In [28]:
df["embarked"] = df["embarked"].convert_dtypes(str)
df["embarked"].dtype

StringDtype

In [29]:
df["boat"] = df["boat"].convert_dtypes(str)
df["boat"].dtype

StringDtype

In [30]:
#Let's replace the "not recovered" in body to an actual number
# We will be replacing with numpy nan
df["body"] = df["body"].replace("not recovered", numpy.nan)
pandas.Series(df["body"])

0         NaN
1         NaN
2         NaN
3       135.0
4         NaN
        ...
1304    328.0
1305      NaN
1306    304.0
1307      NaN
1308      NaN
Name: body, Length: 1306, dtype: float64

In [31]:
#We can then convert it to a integer dtype
df["body"] = df["body"].astype(float)
df["body"].dtype

dtype('float64')

In [32]:
#Let's print out the first 50 rows of our data and see the new look
df[0:50]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,Family Size,Age Group
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,NaN,1,Youth
1,1,1,"Allison, Master. Hudson Trevor",male,0,1,2,113781,151.5500,C22 C26,S,11,NaN,4,Teenager
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.5500,C22 C26,S,Not Specified,NaN,4,Teenager
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.5500,C22 C26,S,Not Specified,135.0,4,Youth
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.5500,C22 C26,S,Not Specified,NaN,4,Youth
5,1,1,"Anderson, Mr. Harry",male,48,0,0,19952,26.5500,E12,S,3,NaN,1,old
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63,1,0,13502,77.9583,D7,S,10,NaN,2,old
7,1,0,"Andrews, Mr. Thomas Jr",male,39,0,0,112050,0.0000,A36,S,Not Specified,NaN,1,Youth
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53,2,0,11769,51.4792,C101,S,D,NaN,3,old
9,1,0,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,Not specified,C,Not Specified,22.0,1,old
10,1,0,"Astor, Col. John Jacob",male,47,1,0,PC 17757,227.5250,C62 C64,C,Not Specified,124.0,2,old
11,1,1,"Astor, Mrs. John Jacob (Madeleine Talmadge Force)",female,18,1,0,PC 17757,227.5250,C62 C64,C,4,NaN,2,Teenager
12,1,1,"Aubart, Mme. Leontine Pauline",female,24,0,0,PC 17477,69.3000,B35,C,9,NaN,1,Youth
13,1,1,"Barber, Miss. Ellen ""Nellie""",female,26,0,0,19877,78.8500,Not specified,S,6,NaN,1,Youth
14,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30.0000,A23,S,B,NaN,1,old
15,1,0,"Baumann, Mr. John D",male,29,0,0,PC 17318,25.9250,Not specified,S,Not Specified,NaN,1,Youth
16,1,0,"Baxter, Mr. Quigg Edmond",male,24,0,1,PC 17558,247.5208,B58 B60,C,Not Specified,NaN,2,Youth
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,2,old
18,1,1,"Bazzani, Miss. Albina",female,32,0,0,11813,76.2917,D15,C,8,NaN,1,Youth
19,1,0,"Beattie, Mr. Thomson",male,36,0,0,13050,75.2417,C6,C,A,NaN,1,Youth
20,1,1,"Beckwith, Mr. Richard Leonard",male,37,1,1,11751,52.5542,D35,S,5,NaN,3,Youth
21,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47,1,1,11751,52.5542,D35,S,5,NaN,3,old
22,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C,5,NaN,1,Youth
23,1,1,"Bidois, Miss. Rosalie",female,42,0,0,PC 17757,227.5250,Not specified,C,4,NaN,1,Youth
24,1,1,"Bird, Miss. Ellen",female,29,0,0,PC 17483,221.7792,C97,S,8,NaN,1,Youth
25,1,0,"Birnbaum, Mr. Jakob",male,25,0,0,13905,26.0000,Not specified,C,Not Specified,148.0,1,Youth
26,1,1,"Bishop, Mr. Dickinson H",male,25,1,0,11967,91.0792,B49,C,7,NaN,2,Youth
27,1,1,"Bishop, Mrs. Dickinson H (Helen Walton)",female,19,1,0,11967,91.0792,B49,C,7,NaN,2,Youth
28,1,1,"Bissette, Miss. Amelia",female,35,0,0,PC 17760,135.6333,C99,S,8,NaN,1,Youth
29,1,1,"Bjornstrom-Steffansson, Mr. Mauritz Hakan",male,28,0,0,110564,26.5500,C52,S,D,NaN,1,Youth
30,1,0,"Blackwell, Mr. Stephen Weart",male,45,0,0,113784,35.5000,T,S,Not Specified,NaN,1,old
31,1,1,"Blank, Mr. Henry",male,40,0,0,112277,31.0000,A31,C,7,NaN,1,Youth
32,1,1,"Bonnell, Miss. Caroline",female,30,0,0,36928,164.8667,C7,S,8,NaN,1,Youth
33,1,1,"Bonnell, Miss. Elizabeth",female,58,0,0,113783,26.5500,C103,S,8,NaN,1,old
34,1,0,"Borebank, Mr. John James",male,42,0,0,110489,26.5500,D22,S,Not Specified,NaN,1,Youth
35,1,1,"Bowen, Miss. Grace Scott",female,45,0,0,PC 17608,262.3750,Not specified,C,4,NaN,1,old
36,1,1,"Bowerman, Miss. Elsie Edith",female,22,0,1,113505,55.0000,E33,S,6,NaN,2,Youth
37,1,1,"Bradley, Mr. George (""George Arthur Brayton"")",male,29,0,0,111427,26.5500,Not specified,S,9,NaN,1,Youth
38,1,0,"Brady, Mr. John Bertram",male,41,0,0,113054,30.5000,A21,S,Not Specified,NaN,1,Youth
39,1,0,"Brandeis, Mr. Emil",male,48,0,0,PC 17591,50.4958,B10,C,Not Specified,208.0,1,old
40,1,0,"Brewe, Dr. Arthur Jackson",male,29,0,0,112379,39.6000,Not specified,C,Not Specified,NaN,1,Youth
41,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44,0,0,PC 17610,27.7208,B4,C,6,NaN,1,Youth
42,1,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59,2,0,11769,51.4792,C101,S,D,NaN,3,old
43,1,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60,0,0,11813,76.2917,D15,C,8,NaN,1,old
44,1,1,"Burns, Miss. Elizabeth Margaret",female,41,0,0,16966,134.5000,E40,C,3,NaN,1,Youth
45,1,0,"Butt, Major. Archibald Willingham",male,45,0,0,113050,26.5500,B38,S,Not Specified,NaN,1,old
46,1,0,"Cairns, Mr. Alexander",male,29,0,0,113798,31.0000,Not specified,S,Not Specified,NaN,1,Youth
47,1,1,"Calderhead, Mr. Edward Pennington",male,42,0,0,PC 17476,26.2875,E24,S,5,NaN,1,Youth
48,1,1,"Candee, Mrs. Edward (Helen Churchill Hungerford)",female,53,0,0,PC 17606,27.4458,Not specified,C,6,NaN,1,old
49,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,2,Youth

In [33]:
df["sex"].unique()

<StringArray>
['female', 'male']
Length: 2, dtype: string